# FINAL-HOMEWORK-FIRST-BLOCK-OF-TRAINING

Написать программу, которая из имеющегося массива строк формирует массив из строк, 
длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры,
либо задать на старте выполнения алгоритма. При решение не рекомендуется пользоваться коллекциями,
лучше обойтись исключительно массивами

Первым делом мы добавляем 2 массива 
В 1 массиве мы указываем длинну массива
А во второй массив добавляем длину первого
То есть оба массива должны быть одинаковой длины

Далее с помощью метода открываем цикл и добавляем наше условие 
if(array1[i].Length <= 3)
И если наше условие успешно выполнятеся, то количество элементов первого массива переходит в количество
второго массива

После этого мы количество увеличиваем на 1 еденицу
Далее открываем цикл for и переменную "i" так - же увеличивем на 1 раз

И в конце мы делаем вывод
А так же не забываем про Console.WriteLine для красивой картинки 

Потом делаем печать
И вроде как всё
